In [3]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [4]:
# Creating a Server Connection to MySQL database

def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name, 
            user = user_name,
            password = user_password)
        print(" My SQL database connection Successful ")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

# Put our MySQL terminal password

pw = "root"

# Database name

db = "mysql_python"
connection = create_server_connection("localhost", "root", pw)

 My SQL database connection Successful

In [5]:
# Creating a database mysql_python

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = "Create Database mysql_python" # the code "Create Database mysql_python" is of mySQL
create_database(connection, create_database_query)

Database created successfully

In [7]:
# Connect to database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(host = host_name, user = user_name, 
                                            passwd = user_password, database = db_name)
        print("Database connection Successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [9]:
# Executing SQL queries
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query Successful")
    except Error as err:
        print(f"Error: '{err}'")

In [11]:
# Creating a table by python in SQL
create_orders_table = '''
create table orders(order_id int primary key, 
                    customer_name varchar(30) not null,
                    product_name varchar(20) not null,
                    date_ordered date,
                    quantity int,
                    unit_price float,
                    phone_number varchar(20));
                    '''
# Connecting to the database
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, create_orders_table)

Database connection Successful
Connection Successful

In [12]:
# Inserting Data into the sql table

data_orders =  ''' insert into orders values 
                (101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '6293730802'),
                (102, 'Jos', 'Books', '2019-02-10', 10,12,'8367489124'),
                (103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '8976123645'),
                (104, 'Nancy', 'T-Shirts', '2018-07-14', 7, 30, '7368145099'),
                (105, 'Maria', 'Headphones', '2019-05-30', 6, 48, '8865316698'),
                (106, 'Dany', 'Smart TV', '2018-08-20', 10, 300, '7720130449'); '''
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, data_orders)

Database connection Successful
Connection Successful

In [14]:
# To read the database from mySQL
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error : '{err}'")

In [16]:
# Using the 'Select' statement of SQL
q1 = ''' Select * from orders;'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

Database connection Successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Dany', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [19]:
# Using the 'Select' statement of SQL
q2 = ''' Select customer_name, phone_number from orders;'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

Database connection Successful
('Steve', '6293730802')
('Jos', '8367489124')
('Stacy', '8976123645')
('Nancy', '7368145099')
('Maria', '8865316698')
('Dany', '7720130449')

In [20]:
# Using the 'Select' statement of SQL
q3 = ''' Select year(date_ordered) from orders;'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

Database connection Successful
(2018,)
(2019,)
(2019,)
(2018,)
(2019,)
(2018,)

In [21]:
# Using the 'Select' statement of SQL
q4 = ''' Select distinct(year(date_ordered)) from orders;'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

Database connection Successful
(2018,)
(2019,)

In [25]:
# Using the 'Where' clause of SQL
q5 = ''' Select * from orders where date_ordered < '2018-12-31';'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

Database connection Successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(106, 'Dany', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [27]:
# Using the 'Where' clause of SQL
q6 = ''' Select * from orders where date_ordered > '2018-12-31';'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

Database connection Successful
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')

In [28]:
# Using the 'Order by' clause of SQL
q7 = ''' Select * from orders order by unit_price;'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

Database connection Successful
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(106, 'Dany', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')

In [29]:
# Using the 'Order by' clause of SQL
q7 = ''' Select * from orders order by unit_price desc;'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

Database connection Successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(106, 'Dany', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')

In [31]:
# Creating pandas DataFrame using SQL Queries
from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
columns = ['order_id', 'customer_name', 'product_name', 'date_ordered', 'quantity', 'unit_price',
          'phone_number']
df = pd.DataFrame(from_db, columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,6293730802
1,106,Dany,Smart TV,2018-08-20,10,300.0,7720130449
2,103,Stacy,Trousers,2019-12-25,5,50.0,8976123645
3,105,Maria,Headphones,2019-05-30,6,48.0,8865316698
4,104,Nancy,T-Shirts,2018-07-14,7,30.0,7368145099
5,102,Jos,Books,2019-02-10,10,12.0,8367489124

In [34]:
# Using 'Update command'

update = ''' update orders set unit_price = 45 where order_id = 103;'''
connection = create_db_connection("localhost", 'root', pw, db)
execute_query(connection, update)

Database connection Successful
Connection Successful

In [36]:
# To show the changes after update command
q8 = ''' Select * from orders where order_id = 103;'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

Database connection Successful
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '8976123645')

In [37]:
# Using Delete command
delete_order = ''' delete from orders where order_id = 105;'''
connection = create_db_connection("localhost", 'root', pw, db)
execute_query(connection, delete_order)

Database connection Successful
Connection Successful

In [38]:
# To show the changes after delete command
q9 = ''' Select * from orders ;'''

connection = create_db_connection("localhost", 'root', pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

Database connection Successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(106, 'Dany', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')